<?php
// +----------------------------------------------------------------------
// | 
// +----------------------------------------------------------------------
// | @copyright (c) 原点 All rights reserved.
// +----------------------------------------------------------------------
// | Author: 原点 <467490186@qq.com>
// +----------------------------------------------------------------------
// | Date: 2025/7/18
// +----------------------------------------------------------------------

declare (strict_types=1);

namespace yuandian\Tools\attribute;

use Attribute;

/**
 * 别名注解，使用此注解的字段会有一个别名，用于Bean拷贝、Bean转Map等
 */
#[Attribute(Attribute::TARGET_PROPERTY)]
class Alias
{
    public function __construct(public string $name)
    {
    }
}