<?php
// +----------------------------------------------------------------------
// | 
// +----------------------------------------------------------------------
// | @copyright (c) 原点 All rights reserved.
// +----------------------------------------------------------------------
// | Author: 原点 <467490186@qq.com>
// +----------------------------------------------------------------------
// | Date: 2024/8/28
// +----------------------------------------------------------------------

declare (strict_types=1);

namespace yuandian\Tools\attribute;

use Attribute;

/**
 * 从字符串的开头和结尾去除空格（或其他字符)
 */
#[Attribute(Attribute::TARGET_PROPERTY)]
class Trim
{
    public function __construct(public string $characters = " \n\r\t\v\0")
    {
    }
}